Revit 2024 API
DimensionSegment.IsTextPositionAdjustable Method
Indicates if this dimension is supported to set/get TextPosition/LeaderPosition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015 Subscription Update
Syntax
C#
public bool IsTextPositionAdjustable()
Visual Basic
Public Function IsTextPositionAdjustable As Boolean
Visual C++
public:
bool IsTextPositionAdjustable()
Return Value
True if this dimension is supported to set/get TextPosition/LeaderPosition, false otherwise.
See Also
DimensionSegment Class
Autodesk.Revit.DB Namespace